<?

$oSangeki = (object)array(
    'title' => '名探偵は今どこに？',
    'secret' => true,
    'writer' => 'ペンスキー',
    'difficulity' => 5,
    'set' => 'MCX',
    'rule' => array(
        '組み重なり事件キルト',
        '私は名探偵',
        '隔離病棟サイコ',
    ),
    'special_rule' => "",
    'loop' => 4,
    'day' => 6,
    'character' => array(
        '神格' => array(
            'note' => '1ループ目',
        ),
        '巫女' => array(
            'role' => 'フレンド',
        ),
        'アイドル' => array(
            'role' => 'パラノイア',
        ),
        '大物' => array(
            'role' => 'メイタンテイ',
            'note' => '学校',
        ),
        '男子学生' => array(
            'role' => 'フール',
        ),
        'お嬢様' => array(
            'role' => 'ミスリーダー',
        ),
        '教師' => array(
            'role' => 'セラピスト',
        ),
    ),
    'incident' => array(
        1 => array(
            'name' => '銀の銃弾',
            'criminal' => '教師',
        ),
        2 => array(
            'name' => '猟奇殺人',
            'criminal' => 'お嬢様',
        ),
        5 => array(
            'name' => '前兆',
            'criminal' => '男子学生',
        ),
    ),
    'advice' => (object)array(
        'notice' => '',
        'summary' => "メイタンテイを巧妙に活用した脚本です。基本的にループ抜けはできませんが、教師や大物、そして各種事件が大いに情報を出します。真相を隠すため、ルールや犯人の隠蔽が重要です。",
        'detail' => "銀の銃弾が起きたら脚本家は敗北します。大物をテリトリーに放り込まれると終わるので、初日は必ず大物に移動縦を張ってください。",
        'template' => array(
            '1ループ目' => array(
                0 => '手先は都市に配置する',
                1 => array(
                    '女子学生' => '不安+1',
                    '手先' => '不安+1',
                    '巫女' => '移動縦',
                ),
                2 => array(
                    '巫女' => '不安+1',
                    '女子学生' => '不安+1',
                    '教師' => '友好禁止',
                ),
            ),
            '2ループ目以降' => array(
                1 => array(
                    '女の子' => '不安禁止',
                    '神格' => '友好禁止',
                ),
                2 => array(
                    '女の子' => '不安禁止',
                    '神格' => '友好禁止',
                ),
                3 => array(
                    '女の子' => '不安禁止',
                    '神格' => '友好禁止',
                ),
                4 => array(
                    '女の子' => '不安禁止',
                    '神格' => '友好禁止',
                ),
                5 => array(
                    '神格' => '友好禁止',
                ),
            ),
        ),
    ),
);
