<?php

$oSangeki = (object)[
    'title' => '',
    'writer' => 'ペンスキー',
    'difficulity' => 4,
    'set' => 'MZ',
    'rule' => [
        '漢の戦い',
        '通わぬ心',
        '神のサイコロ',
    ],
    'special_rule' => "",
    'loop' => 4,
    'day' => 6,
    'character' => [
        '神格' => [
            'note' => '1ループ目',
        ],
        '教祖' => [
        ],
        '黒猫' => [
            'role' => 'ゼッタイシャ',
        ],
        '医者' => [
            'role' => 'ニンジャ',
        ],
        'サラリーマン' => [
            'role' => 'マジシャン',
        ],
        '鑑識官' => [
            'role' => 'シリアルキラー',
        ],
        'A.I.' => [
            'role' => 'ミスリーダー',
        ],
        '転校生' => [
            'note' => '1日目',
        ],
    ],
    'incident' => [
        2 => [
            'name' => '偽装自殺',
            'criminal' => 'サラリーマン',
        ],
        4 => [
            'name' => '告白',
            'criminal' => '黒猫',
        ],
        6 => [
            'name' => '打開',
            'criminal' => '医者',
        ],
    ],
    'advice' => (object)[
        'summary' => "",
        'detail' => "",
        'victoryConditions' => [
            [
                'condition' => '漢の戦い',
                'way' => [
                    'ニンジャまたはその死体に暗躍カウンターを２つ以上乗せる',
                ],
            ],
        ],
        'template' => [
            '基本' => [
                1 => [
                    '女の子' => '不安+1',
                    '男子学生' => '移動縦',
                    'ナース' => '移動横',
                ],
                2 => [
                    '入院患者' => '不安+1',
                    'ナース' => '移動縦',
                ],
            ],
            'シリアルキラーが割れた後・パターン1' => [
                1 => [
                    '神格' => '不安+1',
                    '男子学生' => '移動横',
                    'ナース' => '移動縦',
                ],
                2 => [
                    '入院患者' => '不安+1',
                ],
            ],
            'シリアルキラーが割れた後・パターン2' => [
                1 => [
                    '神格' => '移動横',
                    '男子学生' => 'ブラフ',
                    'ナース' => '移動縦',
                ],
                2 => [
                    '入院患者' => '不安+1',
                ],
            ],
        ],
    ],
];
