<?php

$oSangeki = (object)[
    'title' => '推理ショーの邪魔をするな',
    'writer' => 'ペンスキー',
    'difficulity' => 0,
    'set' => 'LL',
    'rule' => [
        '封印されし終末',
        '私こそが名探偵',
        '不定因子χ怪',
    ],
    'loop' => 4,
    'day' => 6,
    'character' => [
        '神格' => [
            'note' => '3ループ目',
        ],
        '上位存在' => [
        ],
        '入院患者' => [
            'role' => 'フラグメント',
        ],
        '医者' => [
            'role' => 'ジョーカー',
        ],
        '情報屋' => [
            'role' => 'ファクター',
        ],
        '刑事' => [
        ],
        '鑑識官' => [
        ],
        'サラリーマン' => [
            'role' => 'ファクター',
        ],
        '教師' => [
            'role' => 'ウォッチャー',
        ],
        '委員長' => [
            'role' => 'シークレット',
        ],
    ],
    'incident' => [
        3 => [
            'name' => '絶望の闇',
            'criminal' => '医者',
        ],
        4 => [
            'name' => '行方不明',
            'criminal' => '教師',
        ],
        5 => [
            'name' => '希望の光',
            'criminal' => '刑事',
        ],
        6 => [
            'name' => '実行者',
            'criminal' => 'サラリーマン',
        ],
    ],
    'advice' => (object)[
        'summary' => "Last Liar 初プレイ向けに作った脚本（のつもり）です。脚本家は裏切り者Cとの共闘を求められますが、すべての犯人を明らかにされると裏切り者に勝利を掠め取られます。",
        'detail' => "１ループ目：シークレット\n２ループ目：絶望の闇\n３ループ目：フラグメントからの絶望+1\n４ループ目：実行者",
    ],
];
