<?php

$oSangeki = (object)[
    'title' => '',
    'writer' => 'ペンスキー',
    'difficulity' => 0,
    'set' => 'LL',
    'rule' => [
        '封印されし終末',
        '私こそが名探偵',
        '不定因子χ怪',
    ],
    'loop' => 4,
    'day' => 5,
    'character' => [
        '巫女' => [
            'role' => 'ファクター',
        ],
        '入院患者' => [
            'role' => 'フラグメント',
        ],
        '医者' => [
            'role' => 'ジョーカー',
        ],
        '情報屋' => [
            'role' => 'ファクター',
        ],
        '刑事' => [
        ],
        '鑑識官' => [
            'role' => 'インフルエンサー',
        ],
        '教師' => [
        ],
        '委員長' => [
            'role' => 'シークレット',
        ],
    ],
    'incident' => [
        2 => [
            'name' => '',
            'criminal' => '',
        ],
        3 => [
            'name' => '絶望の闇',
            'criminal' => '医者',
        ],
        4 => [
            'name' => '行方不明',
            'criminal' => '教師',
        ],
        5 => [
            'name' => '絶望の闇',
            'criminal' => '委員長',
        ],
    ],
    'advice' => (object)[
        'summary' => "",
        'detail' => "",
        'template' => [
            '1ループ目' => [
                1 => [
                    '病院' => '暗躍+2',
                    '学校' => '暗躍+1',
                    '女子学生' => '不安+1',
                ],
            ],
        ],
    ],
];
