<?php
    $aRuleRoleMaster = [
        'FS' => [
            '殺人計画' => [
                'キーパーソン',
                'クロマク',
                'キラー',
            ],
            '復讐者の灯火' => [
                'クロマク',
            ],
            '守るべき場所' => [
                'キーパーソン',
                'カルティスト',
            ],
            '切り裂き魔の影' => [
                'ミスリーダー',
                'シリアルキラー',
            ],
            '不穏な噂' => [
                'ミスリーダー',
            ],
            '最低の却本' => [
                'ミスリーダー',
                'マイナス',
                'マイナス',
                'フレンド',
            ],
        ],
        'BTX' => [
            '殺人計画' => [
                'キーパーソン',
                'クロマク',
                'キラー',
            ],
            '封印されしもの' => [
                'カルティスト',
                'クロマク',
            ],
            '僕と契約しようよ！' => [
                'キーパーソン',
            ],
            '未来改変プラン' => [
                'タイムトラベラー',
                'カルティスト',
            ],
            '巨大時限爆弾Xの存在' => [
                'ウィッチ',
            ],
            '友情サークル' => [
                'フレンド',
                'フレンド',
                'ミスリーダー',
            ],
            '妄想拡大ウイルス' => [
                'ミスリーダー',
            ],
            '因果の糸' => [
            ],
            '不穏な噂' => [
                'ミスリーダー',
            ],
            '潜む殺人鬼' => [
                'フレンド',
                'シリアルキラー',
            ],
            '恋愛風景' => [
                'メインラバーズ',
                'ラバーズ',
            ],
            '不定因子χ' => [
                'ファクター',
            ],
        ],
        'MZ' => [
            '封印されしもの' => [
                'カルティスト',
                'クロマク',
            ],
            'シークレットレコード' => [
                'キーパーソン',
                'クロマク',
                'ミスリーダー',
            ],
            '漢の戦い' => [
                'ニンジャ',
            ],
            '忍び寄る魔手' => [
                'キーパーソン',
                'ニンジャ',
                'カルティスト',
            ],
            '因果の絆' => [
                'シリアルキラー',
                'フレンド',
                'ミスリーダー',
            ],
            '憎愛スパイラル' => [
                'フレンド',
                'ゼッタイシャ',
            ],
            '神のサイコロ' => [
                'ゼッタイシャ',
                'シリアルキラー',
            ],
            '不定因子χ怪' => [
                'ファクター',
            ],
            '死のショウタイム' => [
                'マジシャン',
                'イモータル',
            ],
            '通わぬ心' => [
                'マジシャン',
                'ミスリーダー',
            ],
            '魔女のお茶会' => [
                'ミスリーダー',
                'フレンド',
                'ウィッチ',
                'ウィッチ',
            ],
            '滅亡を謳うもの' => [
                'プロフェシー',
            ],
        ],
        'MCX' => [
            '殺人計画' => [
                'キーパーソン',
                'クロマク',
                'キラー',
            ],
            '組み重なり事件キルト' => [
                'ミスリーダー',
                'フール',
            ],
            'タイトロープ上の計画' => [
                'クロマク',
                'キラー',
            ],
            '黒の学園' => [
                'クロマク',
            ],
            'ストリキニーネの雫' => [
                'キーパーソン',
                'フール',
                'ドリッパー',
            ],
            '潜む殺人鬼' => [
                'フレンド',
                'シリアルキラー',
            ],
            '隔離病棟サイコ' => [
                'パラノイア',
                'ミスリーダー',
                'セラピスト',
            ],
            '私は名探偵' => [
                'メイタンテイ',
                'ミスリーダー',
                'フレンド',
            ],
            '愚者のダンス' => [
                'フール',
                'フレンド',
            ],
            '火薬の香り' => [
                'シリアルキラー',
            ],
            '絶対の意思' => [
                'ゼッタイシャ',
            ],
            '双子のトリック' => [
                'パラノイア',
                'ツイン',
            ],
        ],
        'HSA' => [
            '高貴なる血族' => [
                'ヴァンパイア',
                'キーパーソン',
            ],
            '月夜の獣' => [
                'ウェアウルフ',
            ],
            '夜霧の悪夢' => [
                'ナイトメア',
            ],
            '墓所より出でし者' => [
            ],
            '呪われし地' => [
                'ミカケダオシ',
                'ゴースト',
            ],
            '一癖あるヤツラ' => [
                'ゴースト',
                'シリアルキラー',
                'メインラバーズ',
            ],
            '恋愛風景' => [
                'メインラバーズ',
                'ラバーズ',
            ],
            '魔女の呪い' => [
                'ミスリーダー',
                'ウィッチ',
            ],
            '鍵たる少女' => [
                'キーパーソン',
            ],
            '恐慌と妄執と' => [
                'シリアルキラー',
                'ウィッチ',
                'チキンハート',
            ],
            '話を聞かない人々' => [
                'ミスリーダー',
                'チキンハート',
                'ミカケダオシ',
            ],
            '怪物の暗躍' => [
                'ミスリーダー',
            ],
        ],
        'WM' => [
            '外なる神への大合唱' => [
                'キーパーソン',
                'ヒトハシラ',
                'イモータル',
            ],
            'だごん様の御言葉' => [
                'キーパーソン',
                'ディープワン',
                'カルティスト',
            ],
            '黄衣の王' => [
                'カルティスト',
                'ヒトハシラ',
            ],
            '巨大時限爆弾Yの存在' => [
                'ウィッチ',
                'ディープワン',
            ],
            '血塗られた儀式' => [
                'イモータル',
                'ウィッチ',
            ],
            '抗うものたち' => [
                'ミスリーダー',
                'シリアルキラー',
                'ウィザード',
            ],
            '見てしまった人々' => [
                'ミスリーダー',
                'モクゲキシャ',
            ],
            '偉大なる種族' => [
                'タイムトラベラー',
                'シリアルキラー',
            ],
            '深き都の囁き' => [
                'ディープワン',
                'パラノイア',
            ],
            '無貌の神' => [
                'フェイスレス',
                'ウィザード',
            ],
            '狂った真実' => [
                'パラノイア',
            ],
            '不穏な噂' => [
                'ミスリーダー',
            ],
        ],
        'UM' => [
            '消された記憶' => [
                'キーパーソン',
                'イレイザー',
            ],
            '絶望のカウントダウン' => [
                'イレイザー',
                'カルティスト',
                'センドウシャ',
            ],
            '守るべき場所' => [
                'キーパーソン',
                'カルティスト',
            ],
            '忘我の果て' => [
                'アベンジャー',
                'セラピスト',
                'シリアルキラー',
            ],
            '復讐者の誓い' => [
                'アベンジャー',
                'フレンド',
            ],
            '問題児の苦悩' => [
                'フレンド',
                'トラブルメイカー',
                'ミスリーダー',
            ],
            '潜む殺人鬼' => [
                'フレンド',
                'シリアルキラー',
            ],
            '開けてはならない扉' => [
                'トラブルメイカー',
            ],
            '隔離病棟サイコ' => [
                'ミスリーダー',
                'セラピスト',
                'パラノイア',
            ],
            'マスヒュプノスの合図' => [
                'センドウシャ',
            ],
            '暴徒を鎮める者' => [
                'センドウシャ',
                'スナイパー',
            ],
            '戻らぬ子どもたち' => [
                'センドウシャ',
                'パイドパイパー',
            ],
        ],
        'AHR' => [
            '閉ざされた未来' => [
                'キーパーソン／ゼッタイシャ',
                'マリオネット',
                'カタリベ',
            ],
            '御伽噺の殺人鬼' => [
                'キーパーソン',
                'ナーサリーライム',
                'クロマク',
            ],
            'マザーグースミステリー' => [
                'マリオネット',
                'カタリベ',
            ],
            '次元併合プラン' => [
                'カタリベ',
                'プレインシフター',
                'フラグメント',
            ],
            '虚ろいゆく世界' => [
                'ゼッタイシャ',
                'マリオネット',
                'クロマク',
            ],
            'ジキルとハイド' => [
                'キーパーソン／クロマク',
                'マリオネット',
            ],
            '悪疫をもたらす者' => [
                'パイドパイパー／ゴシップ',
            ],
            '操りの糸' => [
                'フラグメント',
                'パーソン／シリアルキラー',
                'ゴシップ',
            ],
            '鏡の国のアリス' => [
                'アリス',
                'ミスリーダー／シリアルキラー',
            ],
            '世界線を越えて' => [
                'ミスリーダー',
            ],
            '語られざるべき怪物' => [
                'ミスリーダー／ゼッタイシャ',
                'ゴシップ',
            ],
            '空想拡大ウイルス' => [
                'フラグメント',
                'ミスリーダー',
                'ゴシップ',
            ],
        ],
        'BTX' => [
            '最終計画' => [
                'キーパーソン',
                'クロマク',
                'キラー',
            ],
            '封印されし終末' => [
                'フラグメント',
                'ファクター',
            ],
            '叛逆の世界' => [
                'キーパーソン',
                'フラグメント',
            ],
            '悪魔の脚本' => [
                'シリアルキラー',
                'ウォッチャー',
            ],
            '巨大時限爆弾Zの存在' => [
                'ウィッチ',
                'クロマク',
            ],
            '本当のかいぶつ' => [
                'ジョーカー',
                'シークレット',
                'シリアルキラー',
            ],
            '神話蒐集者' => [
                'ジョーカー',
                'シークレット',
                'インフルエンサー',
            ],
            '私こそが名探偵' => [
                'ジョーカー',
                'シークレット',
                'ウォッチャー',
            ],
            '世界線を越えて' => [
                'ミスリーダー',
            ],
            '不定因子χ怪' => [
                'ファクター',
            ],
            'SNSパラノイア' => [
                'シリアルキラー',
                'インフルエンサー',
                'ミスリーダー',
            ],
            '嘘憑きの秘密' => [
                'ミスリーダー',
            ],
        ],
    ];

    $aIncidentMaster = [
        'FS' => [
            '殺人事件',
            '不安拡大',
            '自殺',
            '行方不明',
            '遠隔殺人',
            '病院の事件',
            '流布',
        ],
        'BTX' => [
            '殺人事件',
            '不安拡大',
            '邪気の汚染',
            '自殺',
            '行方不明',
            '遠隔殺人',
            '病院の事件',
            '蝶の羽ばたき',
            '流布',
        ],
        'MZ' => [
            '連続殺人',
            '自殺',
            '不安拡大',
            '行方不明',
            '陰謀工作',
            '病院の事件',
            '大暴動',
            '告白',
            '打開',
            '偽装自殺',
            '偽装事件',
        ],
        'MCX' => [
            '連続殺人',
            'テロリズム',
            '病院の事件',
            '自殺',
            '不安拡大',
            '前兆',
            '猟奇殺人',
            '偽装自殺',
            '不審な手紙',
            'クローズドサークル',
            '銀の銃弾',
        ],
        'HSA' => [
            '冒涜殺人',
            '不安拡大',
            '邪気の汚染',
            '行方不明',
            '遂行者',
            '噂の御呪い',
            '立てこもり',
            '狂気の夜',
            '呪いの目覚め',
            '穢れの噴出',
            '死者の黙示録',
        ],
        'WM' => [
            '狂気殺人',
            '集団自殺',
            '不安拡大',
            '行方不明',
            '邪気の汚染',
            '病院の事件',
            '大暴動',
            '滅びの火',
            '猟犬の嗅覚',
            '発見',
            '遂行者',
        ],
        'UM' => [
            '連続殺人',
            '不安拡大',
            '自殺',
            '不法投棄',
            '病院の事件',
            '丑の刻参り',
            '怨嗟の雄叫び',
            '遂行者',
            '悪魔との契約',
            '告発',
            '模倣犯',
        ],
        'AHR' => [
            '衝動殺人',
            '次元変貌',
            '次元歪曲',
            '次元断層',
            '忘れ物',
            '空想事件',
            '病院の事件',
            '遺言',
            '特異点',
            '狭間の陽光',
            '絶望の闇',
        ],
        'LL' => [
            '殺人事件',
            '不安拡大',
            '行方不明',
            '病院の事件',
            '実行者',
            '豹変',
            '遺言',
            '告白',
            '流布',
            '希望の光',
            '絶望の闇',
        ],
    ];
