<?php
    $aRuleRoleMaster = array(
        'FS' => array(
            '殺人計画' => array(
                'キーパーソン',
                'クロマク',
                'キラー',
            ),
            '復讐者の灯火' => array(
                'クロマク',
            ),
            '守るべき場所' => array(
                'キーパーソン',
                'カルティスト',
            ),
            '切り裂き魔の影' => array(
                'ミスリーダー',
                'シリアルキラー',
            ),
            '不穏な噂' => array(
                'ミスリーダー',
            ),
            '最低の却本' => array(
                'ミスリーダー',
                'マイナス',
                'マイナス',
                'フレンド',
            ),
        ),
        'BTX' => array(
            '殺人計画' => array(
                'キーパーソン',
                'クロマク',
                'キラー',
            ),
            '封印されしもの' => array(
                'カルティスト',
                'クロマク',
            ),
            '僕と契約しようよ！' => array(
                'キーパーソン',
            ),
            '未来改変プラン' => array(
                'タイムトラベラー',
                'カルティスト',
            ),
            '巨大時限爆弾Xの存在' => array(
                'ウィッチ',
            ),
            '友情サークル' => array(
                'フレンド',
                'フレンド',
                'ミスリーダー',
            ),
            '妄想拡大ウイルス' => array(
                'ミスリーダー',
            ),
            '因果の糸' => array(
            ),
            '不穏な噂' => array(
                'ミスリーダー',
            ),
            '潜む殺人鬼' => array(
                'フレンド',
                'シリアルキラー',
            ),
            '恋愛風景' => array(
                'メインラバーズ',
                'ラバーズ',
            ),
            '不定因子χ' => array(
                'ファクター',
            ),
        ),
        'MZ' => array(
            '封印されしもの' => array(
                'カルティスト',
                'クロマク',
            ),
            'シークレットレコード' => array(
                'キーパーソン',
                'クロマク',
                'ミスリーダー',
            ),
            '漢の戦い' => array(
                'ニンジャ',
            ),
            '忍び寄る魔手' => array(
                'キーパーソン',
                'ニンジャ',
                'カルティスト',
            ),
            '因果の絆' => array(
                'シリアルキラー',
                'フレンド',
                'ミスリーダー',
            ),
            '憎愛スパイラル' => array(
                'フレンド',
                'ゼッタイシャ',
            ),
            '神のサイコロ' => array(
                'ゼッタイシャ',
                'シリアルキラー',
            ),
            '不定因子χ怪' => array(
                'ファクター',
            ),
            '死のショウタイム' => array(
                'マジシャン',
                'イモータル',
            ),
            '通わぬ心' => array(
                'マジシャン',
                'ミスリーダー',
            ),
            '魔女のお茶会' => array(
                'ミスリーダー',
                'フレンド',
                'ウィッチ',
                'ウィッチ',
            ),
            '滅亡を謳うもの' => array(
                'プロフェシー',
            ),
        ),
        'MCX' => array(
            '殺人計画' => array(
                'キーパーソン',
                'クロマク',
                'キラー',
            ),
            '組み重なり事件キルト' => array(
                'ミスリーダー',
                'フール',
            ),
            'タイトロープ上の計画' => array(
                'クロマク',
                'キラー',
            ),
            '黒の学園' => array(
                'クロマク',
            ),
            'ストリキニーネの雫' => array(
                'キーパーソン',
                'フール',
                'ドリッパー',
            ),
            '潜む殺人鬼' => array(
                'フレンド',
                'シリアルキラー',
            ),
            '隔離病棟サイコ' => array(
                'パラノイア',
                'ミスリーダー',
                'セラピスト',
            ),
            '私は名探偵' => array(
                'メイタンテイ',
                'ミスリーダー',
                'フレンド',
            ),
            '愚者のダンス' => array(
                'フール',
                'フレンド',
            ),
            '火薬の香り' => array(
                'シリアルキラー',
            ),
            '絶対の意思' => array(
                'ゼッタイシャ',
            ),
            '双子のトリック' => array(
                'パラノイア',
                'ツイン',
            ),
        ),
        'HSA' => array(
            '高貴なる血族' => array(
                'ヴァンパイア',
                'キーパーソン',
            ),
            '月夜の獣' => array(
                'ウェアウルフ',
            ),
            '夜霧の悪夢' => array(
                'ナイトメア',
            ),
            '墓所より出でし者' => array(
            ),
            '呪われし地' => array(
                'ミカケダオシ',
                'ゴースト',
            ),
            '一癖あるヤツラ' => array(
                'ゴースト',
                'シリアルキラー',
                'メインラバーズ',
            ),
            '恋愛風景' => array(
                'メインラバーズ',
                'ラバーズ',
            ),
            '魔女の呪い' => array(
                'ミスリーダー',
                'ウィッチ',
            ),
            '鍵たる少女' => array(
                'キーパーソン',
            ),
            '恐慌と妄執と' => array(
                'シリアルキラー',
                'ウィッチ',
                'チキンハート',
            ),
            '話を聞かない人々' => array(
                'ミスリーダー',
                'チキンハート',
                'ミカケダオシ',
            ),
            '怪物の暗躍' => array(
                'ミスリーダー',
            ),
        ),
        'WM' => array(
            '外なる神への大合唱' => array(
                'キーパーソン',
                'ヒトハシラ',
                'イモータル',
            ),
            'だごん様の御言葉' => array(
                'キーパーソン',
                'ディープワン',
                'カルティスト',
            ),
            '黄衣の王' => array(
                'カルティスト',
                'ヒトハシラ',
            ),
            '巨大時限爆弾Yの存在' => array(
                'ウィッチ',
                'ディープワン',
            ),
            '血塗られた儀式' => array(
                'イモータル',
                'ウィッチ',
            ),
            '抗うものたち' => array(
                'ミスリーダー',
                'シリアルキラー',
                'ウィザード',
            ),
            '見てしまった人々' => array(
                'ミスリーダー',
                'モクゲキシャ',
            ),
            '偉大なる種族' => array(
                'タイムトラベラー',
                'シリアルキラー',
            ),
            '深き都の囁き' => array(
                'ディープワン',
                'パラノイア',
            ),
            '無貌の神' => array(
                'フェイスレス',
                'ウィザード',
            ),
            '狂った真実' => array(
                'パラノイア',
            ),
            '不穏な噂' => array(
                'ミスリーダー',
            ),
        ),
        'UM' => array(
            '消された記憶' => array(
                'キーパーソン',
                'イレイザー',
            ),
            '絶望のカウントダウン' => array(
                'イレイザー',
                'カルティスト',
                'センドウシャ',
            ),
            '守るべき場所' => array(
                'キーパーソン',
                'カルティスト',
            ),
            '忘我の果て' => array(
                'アベンジャー',
                'セラピスト',
                'シリアルキラー',
            ),
            '復讐者の誓い' => array(
                'アベンジャー',
                'フレンド',
            ),
            '問題児の苦悩' => array(
                'フレンド',
                'トラブルメイカー',
                'ミスリーダー',
            ),
            '潜む殺人鬼' => array(
                'フレンド',
                'シリアルキラー',
            ),
            '開けてはならない扉' => array(
                'トラブルメイカー',
            ),
            '隔離病棟サイコ' => array(
                'ミスリーダー',
                'セラピスト',
                'パラノイア',
            ),
            'マスヒュプノスの合図' => array(
                'センドウシャ',
            ),
            '暴徒を鎮める者' => array(
                'センドウシャ',
                'スナイパー',
            ),
            '戻らぬ子どもたち' => array(
                'センドウシャ',
                'パイドパイパー',
            ),
        ),
    );

    $aInsidentMaster = array(
        'FS' => array(
            '殺人事件',
            '不安拡大',
            '自殺',
            '行方不明',
            '遠隔殺人',
            '病院の事件',
            '流布',
        ),
        'BTX' => array(
            '殺人事件',
            '不安拡大',
            '邪気の汚染',
            '自殺',
            '行方不明',
            '遠隔殺人',
            '病院の事件',
            '蝶の羽ばたき',
            '流布',
        ),
        'MZ' => array(
            '連続殺人',
            '自殺',
            '不安拡大',
            '行方不明',
            '陰謀工作',
            '病院の事件',
            '大暴動',
            '告白',
            '打開',
            '偽装自殺',
            '偽装事件',
        ),
        'MCX' => array(
            '連続殺人',
            'テロリズム',
            '病院の事件',
            '自殺',
            '不安拡大',
            '前兆',
            '猟奇殺人',
            '偽装自殺',
            '不審な手紙',
            'クローズドサークル',
            '銀の銃弾',
        ),
        'HSA' => array(
            '冒涜殺人',
            '不安拡大',
            '邪気の汚染',
            '行方不明',
            '遂行者',
            '噂の御呪い',
            '立てこもり',
            '狂気の夜',
            '呪いの目覚め',
            '穢れの噴出',
            '死者の黙示録',
        ),
        'WM' => array(
            '狂気殺人',
            '集団自殺',
            '不安拡大',
            '行方不明',
            '邪気の汚染',
            '病院の事件',
            '大暴動',
            '滅びの火',
            '猟犬の嗅覚',
            '発見',
            '遂行者',
        ),
        'UM' => array(
            '連続殺人',
            '不安拡大',
            '自殺',
            '不法投棄',
            '病院の事件',
            '丑の刻参り',
            '怨嗟の雄叫び',
            '遂行者',
            '悪魔との契約',
            '告発',
            '模倣犯',
        ),
    );
