<?php
$aTopMenu = array(
    (object)array(
        'href' => 'kyakuhon/',
        'link' => '脚本リスト',
        'img_src' => 'images/kyakuhonka.png',
        'img_alt' => '惨劇 脚本家',
        'text' => "主にペンスキーの考えた自作脚本が転がってます。一部寄稿いただいた脚本もあります。紙の用意がいらないので、ペンスキーの脚本はほぼ全てここに集約されてる模様。",
    ),
    (object)array(
        'href' => 'kifu/',
        'link' => '棋譜記録機能',
        'img_src' => 'images/heros.png',
        'img_alt' => '主人公たち',
        'text' => "各ループ各ターン、脚本家がどこにどのカードを置いたかは、時に推理を進めるための重要な手がかりとなります。\n紙とペンがあるならそっちの方が良いとは思いますが、お気に召したら嬉しい限りです。",
    ),
    (object)array(
        'href' => 'column/',
        'link' => '駄文',
        'img_src' => 'images/uzai.png',
        'img_alt' => '脚本を彩る名優たち',
        'text' => "ペンスキー流の脚本の書き方とか、関連アイディアの投棄場。脚本リストに挙がっているものの一部で実際に使われているアイディアもあります。\nもう脚本を自作されている方には何を今更といった感じですが、読み物としてでも楽しんで頂ければ幸い。\n惨劇RoopeRの脚本書くの楽しいよ！",
    ),
);
